zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32ck_sg_gc/pic32ck_gc01/pic32ck1012gc01100-pinctrl.h
#define PA15C_SERCOM5_PAD2 MCHP_PINMUX(a, 15, c, periph)

#define PA15F_TCC5_WO0 MCHP_PINMUX(a, 15, f, periph)

#define PA15M_CCL_IN11 MCHP_PINMUX(a, 15, m, periph)

#define PA16_GPIO MCHP_PINMUX(a, 16, gpio, gpio)

#define PA16A_EIC_EXTINT0 MCHP_PINMUX(a, 16, a, periph)

#define PA16C_SERCOM5_PAD3 MCHP_PINMUX(a, 16, c, periph)

#define PA16F_TCC5_WO1 MCHP_PINMUX(a, 16, f, periph)

#define PA16M_CCL_OUT3 MCHP_PINMUX(a, 16, m, periph)

#define PA17_GPIO MCHP_PINMUX(a, 17, gpio, gpio)

#define PA17A_EIC_EXTINT1 MCHP_PINMUX(a, 17, a, periph)

#define PA17M_GCLK_IO6 MCHP_PINMUX(a, 17, m, periph)

#define PA18_GPIO MCHP_PINMUX(a, 18, gpio, gpio)

#define PA18A_EIC_EXTINT2 MCHP_PINMUX(a, 18, a, periph)

#define PA18B_ADC_VINM4 MCHP_PINMUX(a, 18, b, periph)

#define PA18F_TCC3_WO5 MCHP_PINMUX(a, 18, f, periph)

#define PA18N_PTC_ECI0 MCHP_PINMUX(a, 18, n, periph)

#define PA19_GPIO MCHP_PINMUX(a, 19, gpio, gpio)

#define PA19A_EIC_EXTINT3 MCHP_PINMUX(a, 19, a, periph)

#define PA19F_TCC3_WO7 MCHP_PINMUX(a, 19, f, periph)

#define PA19N_PTC_ECI1 MCHP_PINMUX(a, 19, n, periph)

#define PB0_GPIO MCHP_PINMUX(b, 0, gpio, gpio)

#define PB0A_EIC_EXTINT0 MCHP_PINMUX(b, 0, a, periph)

#define PB0B_ADC_VINP9 MCHP_PINMUX(b, 0, b, periph)

#define PB0C_SERCOM5_PAD2 MCHP_PINMUX(b, 0, c, periph)

#define PB0F_TCC5_WO0 MCHP_PINMUX(b, 0, f, periph)

#define PB0G_TCC3_WO4 MCHP_PINMUX(b, 0, g, periph)

#define PB0H_CAN0_TX MCHP_PINMUX(b, 0, h, periph)

#define PB0I_SDMMC0_SDWP MCHP_PINMUX(b, 0, i, periph)

#define PB0J_SPI_IXS_SDO MCHP_PINMUX(b, 0, j, periph)

#define PB0M_CCL_IN6 MCHP_PINMUX(b, 0, m, periph)

#define PB0N_PTC_DRV4 MCHP_PINMUX(b, 0, n, periph)

#define PB1_GPIO MCHP_PINMUX(b, 1, gpio, gpio)

#define PB1A_EIC_EXTINT1 MCHP_PINMUX(b, 1, a, periph)

#define PB1B_ADC_VREFP0 MCHP_PINMUX(b, 1, b, periph)

#define PB1C_SERCOM5_PAD3 MCHP_PINMUX(b, 1, c, periph)

#define PB1F_TCC5_WO1 MCHP_PINMUX(b, 1, f, periph)

#define PB1G_TCC3_WO5 MCHP_PINMUX(b, 1, g, periph)

#define PB1H_CAN0_RX MCHP_PINMUX(b, 1, h, periph)

#define PB1M_CCL_IN7 MCHP_PINMUX(b, 1, m, periph)

#define PB1N_PTC_DRV5 MCHP_PINMUX(b, 1, n, periph)

#define PB2_GPIO MCHP_PINMUX(b, 2, gpio, gpio)

#define PB2A_EIC_EXTINT2 MCHP_PINMUX(b, 2, a, periph)

#define PB2M_CCL_IN0 MCHP_PINMUX(b, 2, m, periph)

#define PB3_GPIO MCHP_PINMUX(b, 3, gpio, gpio)

#define PB3A_EIC_EXTINT3 MCHP_PINMUX(b, 3, a, periph)

#define PB3M_CCL_IN1 MCHP_PINMUX(b, 3, m, periph)

#define PB4_GPIO MCHP_PINMUX(b, 4, gpio, gpio)

#define PB4A_EIC_EXTINT4 MCHP_PINMUX(b, 4, a, periph)

#define PB4C_SERCOM4_PAD0 MCHP_PINMUX(b, 4, c, periph)

#define PB4D_SERCOM4_PAD0 MCHP_PINMUX(b, 4, d, periph)

#define PB4F_TCC0_WO0 MCHP_PINMUX(b, 4, f, periph)

#define PB4G_PDEC_QDI0 MCHP_PINMUX(b, 4, g, periph)

#define PB4M_CCL_IN8 MCHP_PINMUX(b, 4, m, periph)

#define PB5_GPIO MCHP_PINMUX(b, 5, gpio, gpio)

#define PB5A_EIC_EXTINT5 MCHP_PINMUX(b, 5, a, periph)

#define PB5C_SERCOM4_PAD1 MCHP_PINMUX(b, 5, c, periph)

#define PB5D_SERCOM4_PAD1 MCHP_PINMUX(b, 5, d, periph)

#define PB5F_TCC0_WO1 MCHP_PINMUX(b, 5, f, periph)

#define PB5G_PDEC_QDI1 MCHP_PINMUX(b, 5, g, periph)

#define PB5M_CCL_OUT3 MCHP_PINMUX(b, 5, m, periph)

#define PB6_GPIO MCHP_PINMUX(b, 6, gpio, gpio)

#define PB6A_EIC_EXTINT6 MCHP_PINMUX(b, 6, a, periph)

#define PB6C_SERCOM4_PAD3 MCHP_PINMUX(b, 6, c, periph)

#define PB6D_SERCOM4_PAD3 MCHP_PINMUX(b, 6, d, periph)

#define PB6F_TCC0_WO3 MCHP_PINMUX(b, 6, f, periph)

#define PB6G_PDEC_QDI2 MCHP_PINMUX(b, 6, g, periph)

#define PB6M_CCL_OUT0 MCHP_PINMUX(b, 6, m, periph)

#define PB7_GPIO MCHP_PINMUX(b, 7, gpio, gpio)

#define PB7A_EIC_EXTINT7 MCHP_PINMUX(b, 7, a, periph)

#define PB7C_SERCOM3_PAD2 MCHP_PINMUX(b, 7, c, periph)

#define PB7D_SERCOM4_PAD2 MCHP_PINMUX(b, 7, d, periph)

#define PB7G_PDEC_QDI0 MCHP_PINMUX(b, 7, g, periph)

#define PB7I_SDMMC0_SDCMD MCHP_PINMUX(b, 7, i, periph)

#define PB7K_PCC_DATA3 MCHP_PINMUX(b, 7, k, periph)

#define PB7M_CCL_IN0 MCHP_PINMUX(b, 7, m, periph)

#define PB7N_PTC_DRV6 MCHP_PINMUX(b, 7, n, periph)

#define PB8_GPIO MCHP_PINMUX(b, 8, gpio, gpio)

#define PB8A_EIC_EXTINT8 MCHP_PINMUX(b, 8, a, periph)

#define PB8C_SERCOM3_PAD3 MCHP_PINMUX(b, 8, c, periph)

#define PB8D_SERCOM4_PAD3 MCHP_PINMUX(b, 8, d, periph)

#define PB8G_PDEC_QDI1 MCHP_PINMUX(b, 8, g, periph)

#define PB8H_CAN0_TX MCHP_PINMUX(b, 8, h, periph)

#define PB8K_PCC_DATA4 MCHP_PINMUX(b, 8, k, periph)

#define PB8M_CCL_IN1 MCHP_PINMUX(b, 8, m, periph)

#define PB8N_PTC_DRV7 MCHP_PINMUX(b, 8, n, periph)

#define PB9_GPIO MCHP_PINMUX(b, 9, gpio, gpio)

#define PB9A_EIC_EXTINT9 MCHP_PINMUX(b, 9, a, periph)

#define PB9C_SERCOM4_PAD0 MCHP_PINMUX(b, 9, c, periph)

#define PB9D_SERCOM4_PAD1 MCHP_PINMUX(b, 9, d, periph)

#define PB9G_PDEC_QDI2 MCHP_PINMUX(b, 9, g, periph)

#define PB9H_CAN0_RX MCHP_PINMUX(b, 9, h, periph)

#define PB9K_PCC_DATA5 MCHP_PINMUX(b, 9, k, periph)

#define PB9M_CCL_IN2 MCHP_PINMUX(b, 9, m, periph)

#define PB9N_PTC_DRV8 MCHP_PINMUX(b, 9, n, periph)

#define PB10_GPIO MCHP_PINMUX(b, 10, gpio, gpio)

#define PB10A_EIC_EXTINT10 MCHP_PINMUX(b, 10, a, periph)

#define PB10C_SERCOM4_PAD1 MCHP_PINMUX(b, 10, c, periph)

#define PB10D_SERCOM4_PAD0 MCHP_PINMUX(b, 10, d, periph)

#define PB10G_TCC0_WO0 MCHP_PINMUX(b, 10, g, periph)

#define PB10I_SDMMC0_SDDAT0 MCHP_PINMUX(b, 10, i, periph)

#define PB10K_PCC_DATA6 MCHP_PINMUX(b, 10, k, periph)

#define PB10L_ETH_MDC MCHP_PINMUX(b, 10, l, periph)

#define PB10M_CCL_OUT0 MCHP_PINMUX(b, 10, m, periph)

#define PB10N_PTC_DRV9 MCHP_PINMUX(b, 10, n, periph)

#define PB11_GPIO MCHP_PINMUX(b, 11, gpio, gpio)

#define PB11A_EIC_EXTINT11 MCHP_PINMUX(b, 11, a, periph)

#define PB11B_ADC_VINP10 MCHP_PINMUX(b, 11, b, periph)

#define PB11G_TCC3_WO6 MCHP_PINMUX(b, 11, g, periph)

#define PB12_GPIO MCHP_PINMUX(b, 12, gpio, gpio)

#define PB12A_EIC_EXTINT12 MCHP_PINMUX(b, 12, a, periph)

#define PB12B_ADC_VINP11 MCHP_PINMUX(b, 12, b, periph)

#define PB12F_TCC4_WO0 MCHP_PINMUX(b, 12, f, periph)

#define PB12G_TCC3_WO7 MCHP_PINMUX(b, 12, g, periph)

