zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32ck_sg_gc/pic32ck_gc01/pic32ck1012gc01100-pinctrl.h
#define PB13_GPIO MCHP_PINMUX(b, 13, gpio, gpio)

#define PB13A_EIC_EXTINT13 MCHP_PINMUX(b, 13, a, periph)

#define PB13C_SERCOM4_PAD2 MCHP_PINMUX(b, 13, c, periph)

#define PB13F_TCC0_WO2 MCHP_PINMUX(b, 13, f, periph)

#define PB13G_PDEC_QDI2 MCHP_PINMUX(b, 13, g, periph)

#define PB14_GPIO MCHP_PINMUX(b, 14, gpio, gpio)

#define PB14A_EIC_EXTINT14 MCHP_PINMUX(b, 14, a, periph)

#define PB14F_TCC0_WO4 MCHP_PINMUX(b, 14, f, periph)

#define PB15_GPIO MCHP_PINMUX(b, 15, gpio, gpio)

#define PB15A_EIC_EXTINT15 MCHP_PINMUX(b, 15, a, periph)

#define PB15F_TCC0_WO5 MCHP_PINMUX(b, 15, f, periph)

#define PB16_GPIO MCHP_PINMUX(b, 16, gpio, gpio)

#define PB16A_EIC_EXTINT0 MCHP_PINMUX(b, 16, a, periph)

#define PB16C_SERCOM3_PAD0 MCHP_PINMUX(b, 16, c, periph)

#define PB16H_CAN0_TX MCHP_PINMUX(b, 16, h, periph)

#define PB16N_PTC_DRV24 MCHP_PINMUX(b, 16, n, periph)

#define PB17_GPIO MCHP_PINMUX(b, 17, gpio, gpio)

#define PB17A_EIC_EXTINT1 MCHP_PINMUX(b, 17, a, periph)

#define PB17C_SERCOM3_PAD1 MCHP_PINMUX(b, 17, c, periph)

#define PB17H_CAN0_RX MCHP_PINMUX(b, 17, h, periph)

#define PB17N_PTC_DRV25 MCHP_PINMUX(b, 17, n, periph)

#define PC0_GPIO MCHP_PINMUX(c, 0, gpio, gpio)

#define PC0A_EIC_EXTINT0 MCHP_PINMUX(c, 0, a, periph)

#define PC0C_SERCOM4_PAD2 MCHP_PINMUX(c, 0, c, periph)

#define PC0D_SERCOM3_PAD3 MCHP_PINMUX(c, 0, d, periph)

#define PC0G_TCC0_WO1 MCHP_PINMUX(c, 0, g, periph)

#define PC0I_SDMMC0_SDDAT1 MCHP_PINMUX(c, 0, i, periph)

#define PC0K_PCC_DATA7 MCHP_PINMUX(c, 0, k, periph)

#define PC0L_ETH_REF_CLK MCHP_PINMUX(c, 0, l, periph)

#define PC0L_ETH_TX_CLK MCHP_PINMUX(c, 0, l, periph)

#define PC0M_GCLK_IO2 MCHP_PINMUX(c, 0, m, periph)

#define PC0N_PTC_DRV10 MCHP_PINMUX(c, 0, n, periph)

#define PC0O_ETH_TX_CLK MCHP_PINMUX(c, 0, o, periph)

#define PC0P_SQI_CS1 MCHP_PINMUX(c, 0, p, periph)

#define PC1_GPIO MCHP_PINMUX(c, 1, gpio, gpio)

#define PC1A_EIC_EXTINT1 MCHP_PINMUX(c, 1, a, periph)

#define PC1C_SERCOM4_PAD3 MCHP_PINMUX(c, 1, c, periph)

#define PC1D_SERCOM3_PAD2 MCHP_PINMUX(c, 1, d, periph)

#define PC1G_TCC0_WO2 MCHP_PINMUX(c, 1, g, periph)

#define PC1H_USB_SOF_1KHZ MCHP_PINMUX(c, 1, h, periph)

#define PC1I_SDMMC0_SDDAT2 MCHP_PINMUX(c, 1, i, periph)

#define PC1K_PCC_DATA0 MCHP_PINMUX(c, 1, k, periph)

#define PC1M_GCLK_IO3 MCHP_PINMUX(c, 1, m, periph)

#define PC1N_PTC_DRV11 MCHP_PINMUX(c, 1, n, periph)

#define PC1O_ETH_RXD1 MCHP_PINMUX(c, 1, o, periph)

#define PC1P_SQI_CS0 MCHP_PINMUX(c, 1, p, periph)

#define PC2_GPIO MCHP_PINMUX(c, 2, gpio, gpio)

#define PC2A_EIC_EXTINT2 MCHP_PINMUX(c, 2, a, periph)

#define PC2C_SERCOM3_PAD0 MCHP_PINMUX(c, 2, c, periph)

#define PC2D_SERCOM2_PAD3 MCHP_PINMUX(c, 2, d, periph)

#define PC2G_TCC0_WO3 MCHP_PINMUX(c, 2, g, periph)

#define PC2H_CAN0_TX MCHP_PINMUX(c, 2, h, periph)

#define PC2I_SDMMC0_SDDAT3 MCHP_PINMUX(c, 2, i, periph)

#define PC2K_PCC_DATA1 MCHP_PINMUX(c, 2, k, periph)

#define PC2L_ETH_MDIO MCHP_PINMUX(c, 2, l, periph)

#define PC2M_GCLK_IO4 MCHP_PINMUX(c, 2, m, periph)

#define PC2N_PTC_DRV12 MCHP_PINMUX(c, 2, n, periph)

#define PC2O_ETH_RXD0 MCHP_PINMUX(c, 2, o, periph)

#define PC2P_SQI_DATA0 MCHP_PINMUX(c, 2, p, periph)

#define PC3_GPIO MCHP_PINMUX(c, 3, gpio, gpio)

#define PC3A_EIC_EXTINT3 MCHP_PINMUX(c, 3, a, periph)

#define PC3C_SERCOM3_PAD1 MCHP_PINMUX(c, 3, c, periph)

#define PC3G_TCC0_WO4 MCHP_PINMUX(c, 3, g, periph)

#define PC3H_CAN0_RX MCHP_PINMUX(c, 3, h, periph)

#define PC3I_SDMMC0_SDWP MCHP_PINMUX(c, 3, i, periph)

#define PC3K_PCC_DATA2 MCHP_PINMUX(c, 3, k, periph)

#define PC3L_ETH_MDC MCHP_PINMUX(c, 3, l, periph)

#define PC3M_GCLK_IO5 MCHP_PINMUX(c, 3, m, periph)

#define PC3N_PTC_DRV13 MCHP_PINMUX(c, 3, n, periph)

#define PC3O_ETH_RXER MCHP_PINMUX(c, 3, o, periph)

#define PC3P_SQI_DATA2 MCHP_PINMUX(c, 3, p, periph)

#define PC4_GPIO MCHP_PINMUX(c, 4, gpio, gpio)

#define PC4A_EIC_EXTINT4 MCHP_PINMUX(c, 4, a, periph)

#define PC4C_SERCOM3_PAD2 MCHP_PINMUX(c, 4, c, periph)

#define PC4G_TCC0_WO5 MCHP_PINMUX(c, 4, g, periph)

#define PC4I_SDMMC0_SDCD MCHP_PINMUX(c, 4, i, periph)

#define PC4K_PCC_DEN1 MCHP_PINMUX(c, 4, k, periph)

#define PC4L_ETH_MDIO MCHP_PINMUX(c, 4, l, periph)

#define PC4M_GCLK_IO6 MCHP_PINMUX(c, 4, m, periph)

#define PC4N_PTC_DRV14 MCHP_PINMUX(c, 4, n, periph)

#define PC5_GPIO MCHP_PINMUX(c, 5, gpio, gpio)

#define PC5A_EIC_EXTINT5 MCHP_PINMUX(c, 5, a, periph)

#define PC5C_SERCOM3_PAD3 MCHP_PINMUX(c, 5, c, periph)

#define PC5D_SERCOM2_PAD2 MCHP_PINMUX(c, 5, d, periph)

#define PC5G_TCC1_WO0 MCHP_PINMUX(c, 5, g, periph)

#define PC5I_SDMMC0_SDCK MCHP_PINMUX(c, 5, i, periph)

#define PC5K_PCC_CLK MCHP_PINMUX(c, 5, k, periph)

#define PC5L_ETH_RXD2 MCHP_PINMUX(c, 5, l, periph)

#define PC5M_GCLK_IO7 MCHP_PINMUX(c, 5, m, periph)

#define PC5N_PTC_DRV15 MCHP_PINMUX(c, 5, n, periph)

#define PC5O_ETH_TXEN MCHP_PINMUX(c, 5, o, periph)

#define PC5P_SQI_DATA3 MCHP_PINMUX(c, 5, p, periph)

#define PC6_GPIO MCHP_PINMUX(c, 6, gpio, gpio)

#define PC6A_EIC_EXTINT6 MCHP_PINMUX(c, 6, a, periph)

#define PC6B_AC_AIN2 MCHP_PINMUX(c, 6, b, periph)

#define PC6C_SERCOM2_PAD0 MCHP_PINMUX(c, 6, c, periph)

#define PC6D_SERCOM3_PAD1 MCHP_PINMUX(c, 6, d, periph)

#define PC6G_TCC1_WO1 MCHP_PINMUX(c, 6, g, periph)

#define PC6H_CAN0_TX MCHP_PINMUX(c, 6, h, periph)

#define PC6I_SDMMC0_SDCMD MCHP_PINMUX(c, 6, i, periph)

#define PC6K_PCC_DATA3 MCHP_PINMUX(c, 6, k, periph)

#define PC6L_ETH_RXD1 MCHP_PINMUX(c, 6, l, periph)

#define PC6M_CCL_IN5 MCHP_PINMUX(c, 6, m, periph)

#define PC6N_PTC_DRV16 MCHP_PINMUX(c, 6, n, periph)

#define PC6O_ETH_TXD0 MCHP_PINMUX(c, 6, o, periph)

#define PC6P_SQI_CLK MCHP_PINMUX(c, 6, p, periph)

#define PC7_GPIO MCHP_PINMUX(c, 7, gpio, gpio)

#define PC7A_EIC_EXTINT7 MCHP_PINMUX(c, 7, a, periph)

#define PC7B_AC_AIN3 MCHP_PINMUX(c, 7, b, periph)

#define PC7C_SERCOM2_PAD1 MCHP_PINMUX(c, 7, c, periph)

#define PC7D_SERCOM3_PAD0 MCHP_PINMUX(c, 7, d, periph)

#define PC7G_TCC1_WO2 MCHP_PINMUX(c, 7, g, periph)

#define PC7H_CAN0_RX MCHP_PINMUX(c, 7, h, periph)

#define PC7I_SDMMC0_SDDAT0 MCHP_PINMUX(c, 7, i, periph)

#define PC7K_PCC_DATA4 MCHP_PINMUX(c, 7, k, periph)

#define PC7L_ETH_RXD0 MCHP_PINMUX(c, 7, l, periph)

#define PC7M_CCL_OUT2 MCHP_PINMUX(c, 7, m, periph)

#define PC7N_PTC_DRV17 MCHP_PINMUX(c, 7, n, periph)

#define PC7O_ETH_TXD1 MCHP_PINMUX(c, 7, o, periph)

#define PC7P_SQI_DATA1 MCHP_PINMUX(c, 7, p, periph)

#define PC9_GPIO MCHP_PINMUX(c, 9, gpio, gpio)

#define PC9A_EIC_EXTINT9 MCHP_PINMUX(c, 9, a, periph)

#define PC9C_SERCOM2_PAD2 MCHP_PINMUX(c, 9, c, periph)

